---
kind: property
id: P:Autodesk.Revit.UI.Selection.PickedBox.Max
source: html/6f6f48f8-23d8-9324-b145-cd55280a8e05.htm
---
# Autodesk.Revit.UI.Selection.PickedBox.Max Property

Maximum coordinates (upper-right-front corner of the pick box).

## Syntax (C#)
```csharp
public XYZ Max { get; set; }
```